{
  "sort": {
    "label": "Trier par",
    "placeholder": "Choisissez...",
    "priceLowHigh": "Prix : du plus bas au plus élevé",
    "priceHighLow": "Prix : du plus élevé au plus bas",
    "newest": "Les plus récents",
    "latest": "Les plus anciens"
  },
  "priceFilter": {
    "label": "Prix",
    "to": "à"
  },
  "search": {
    "label": "Rechercher"
  },
  "navbar": {
    "cart": "Panier"
  },
  "modal": {
    "addToCart": "Ajouter au panier",
    "seeRepo": "Voir repo",
    "seeLive": "Voir live"
  },
  "checkout": {
    "empty": "Votre panier est vide",
    "subtotal": "Sous-total",
    "vat": "TVA",
    "checkout": "Valider la commande",
    "addMore": "Ajouter plus de projets",
    "clearCart": "Vider le panier"
  },
  "readncollect": {
    "excerpt": "Transformez les articles en une mosaïque de connaissances. Extrayez, élaborez et exportez vos idées.",
    "description": "<p>L'application permet aux utilisateurs d'entrer des URLs d'articles, en extrayant le contenu essentiel. Mais ce n'est pas qu'une simple plateforme de prise de notes. Son atout réside dans sa fonction de collage unique. Les utilisateurs peuvent fusionner, réarranger et élaborer leurs notes en une mosaïque de connaissances personnalisée. C'est comme une toile où les idées de différents articles se rencontrent harmonieusement.</p><p>Et si vous pouviez tenir cette toile entre vos mains ? Reconnaissant la valeur des insights tangibles, j'ai intégré une fonction permettant aux utilisateurs d'exporter leurs collages de connaissances sous forme de PDF bien organisé. Ce n'est pas qu'une app; c'est une solution conçue pour les lecteurs de l'ère numérique.</p> <h4>Technologies utilisées :</h4><ul><li>Typescript : Pour une expérience frontend fiable.</li><li>Python : Alimentant le backend pour un traitement des données efficace.</li></ul>"
  },
  "chaton": {
    "excerpt": "Jeu 2D développé avec Unity et C#.",
    "description": "<p>Plongez dans le monde délicieux de Chaton, un jeu 2D où les joueurs guident un chat fantaisiste à travers une pluie de diamants, de canards et plus encore. L'objectif est simple mais captivant : collecter de précieux diamants pour la dulcinée du chat tout en esquivant les obstacles malicieux qui peuvent entraver votre parcours.</p><h3>Points Forts :</h3><ul><li>Mécanismes de jeu dynamiques avec une difficulté et une vitesse croissantes à mesure que vous progressez.</li><li>Bandes sonores et effets sonores captivants qui immergent les joueurs dans le jeu.</li><li>Classement des meilleurs scores pour défier et concurrencer ses amis.</li></ul><h3>Technologies Utilisées :</h3><ul><li>Unity : Comme plateforme principale de développement de jeux.</li><li>C# pour les scripts et les mécanismes de jeu.</li></ul>"
  },
  "mistergoodbeer": {
    "excerpt": "Application mobile pour les amateurs de bière",
    "description": "<div class=\"project-description-fr\"><h3>Contribution à l'application MisterGoodBeer</h3><p>En tant que contributeur à l'application MisterGoodBeer, une plateforme captivante dédiée à aider les amateurs de bière à découvrir les bars les plus proches proposant les pintes les plus abordables, des améliorations notables ont été apportées à la couche frontend. Développée avec le framework <strong>Flutter</strong>, l'application garantit non seulement la compatibilité sur les plateformes <strong>iOS et Android</strong>, mais compte également une base impressionnante de <strong>plus de 40 000 utilisateurs actifs</strong>. Utilisant <strong>Firebase</strong> pour ses besoins backend, l'application assure une gestion efficace des données et une expérience utilisateur fluide. Sans être le développeur original de l'application, la contribution au frontend a amplifié son esthétique, sa réactivité et ses fonctionnalités centrées sur l'utilisateur.</p></div>"
  },
  "voyageLudique": {
    "excerpt": "Tracker d'échanges de jeux de plateau",
    "description": "<p>Voyage Ludique est une plateforme dédiée conçue pour renforcer une communauté de jeux de société en simplifiant le suivi d'une collection circulante de 70 jeux. Lorsque les jeux changent de main, les membres peuvent facilement localiser leur emplacement actuel, garantissant transparence et responsabilité au sein de la communauté.</p><h4>Technologies utilisées :</h4><ul><li>Frontend : React et TypeScript pour une application moderne, évolutive et sûre.</li><li>Backend : Supabase pour des capacités de gestion de données robustes et une intégration transparente avec React.</li><li>Express : Backend API pour une flexibilité et un contrôle accrus.</li></ul><h4>Les raisons pour lesquelles il se distingue :</h4><ul><li>Issu d'un engagement communautaire direct et méticuleusement adapté à leurs besoins.</li><li>Démontre l'adaptabilité, la compétence technique et la résonance authentique avec les utilisateurs finaux.</li></ul>"
  },
  "searchHackerNews": {
    "excerpt": "Outil dynamique d'exploration d'articles tech.",
    "description": "<h2>Search Hacker News : Un outil de recherche dynamique</h2><p>Un package npm élégant et interactif offrant une expérience de recherche rapide et centrée sur l'utilisateur pour explorer les articles de la plateforme renommée, Hacker News.</p><h3>Points forts :</h3><ul><li>Intégration intuitive avec l'API de Hacker News garantissant aux utilisateurs des résultats précis et à jour.</li><li>Fonction dédiée de suppression d'histoire, adaptée aux listes de lecture personnalisées.</li></ul><h3>Technologies utilisées :</h3><ul><li>React : Construction efficace des composants UI et gestion des transitions d'état.</li><li>API de Hacker News : Accès à une vaste base de données d'articles liés à la technologie.</li><li>React-Reveal & React-Flip : Intégrés pour des animations fluides et une interactivité utilisateur.</li></ul>"
  },
  "banqueImages": {
    "excerpt": "Banque d'images dynamique avec API Unsplash en React.",
    "description": "<p>Présentation d'une banque d'images dynamique alimentée par l'API Unsplash, offrant une interface conviviale pour la recherche et la visualisation de photos haute résolution. L'interface interactive est efficacement conçue avec React.</p><h3>Points Forts :</h3><ul><li>Intégration transparente avec l'API Unsplash, facilitant la récupération d'images de qualité.</li><li>Dispose d'une fonction de recherche complète, permettant aux utilisateurs d'explorer facilement une vaste collection d'images.</li><li>Optimisé pour l'interaction utilisateur, chargeant automatiquement de nouvelles images lors du défilement, le tout accentué par des animations de révélation captivantes.</li></ul><h3>Technologies Utilisées :</h3><ul><li>React : Utilisé pour construire une interface utilisateur réactive et gérer l'état de l'application.</li><li>API Unsplash : Exploitée pour fournir une riche collection d'images.</li><li>React-Reveal : Intégré pour améliorer l'UX avec des animations élégantes.</li></ul>"
  },
  "markdownPreviewer": {
    "excerpt": "Outil intuitif pour un rendu markdown en temps réel.",
    "description": "<h2>Prévisualisateur Markdown : Outil Dynamique de Rendu Markdown</h2><p>Un outil intuitif et convivial conçu pour faciliter le rendu markdown en temps réel. Avec une interface fluide, les utilisateurs peuvent sans effort entrer leur contenu markdown et visualiser instantanément sa version formatée.</p><h3>Points Forts :</h3><ul><li>Rendu markdown en direct offrant un retour immédiat à l'utilisateur.</li><li>Modal d'aide intégré pour la syntaxe markdown, garantissant une facilité d'utilisation même pour ceux qui ne sont pas familiers avec markdown.</li><li>Animations élégantes avec React-Reveal pour une meilleure engagement utilisateur.</li></ul><h3>Technologies Utilisées :</h3><ul><li>React : Pour construire une interface utilisateur dynamique et réactive.</li><li>ReactMarkdown : Pour traduire efficacement la syntaxe markdown en contenu HTML.</li><li>React-Reveal : Utilisé pour des animations UI fluides.</li></ul>"
  },
  "generateurDeCouleurs": {
    "excerpt": "Générateur de couleurs interactif pour palettes de dégradés.",
    "description": "<h2>Générateur de Couleurs: Palettes de Couleurs Personnalisables</h2><p>Plongez dans un univers de couleurs avec ce générateur de couleurs interactif. Cet outil permet aux utilisateurs de créer facilement une palette de dégradés à partir d'une couleur de base, offrant inspiration et codes hex exacts pour des fins de design.</p><h3>Points Forts :</h3><ul><li>Génération dynamique de palettes de couleurs basée sur une couleur de base définie par l'utilisateur.</li><li>Couleurs cliquables qui copient directement la valeur hexadécimale dans le presse-papiers avec une alerte de notification.</li><li>Animations fluides avec React-Reveal pour améliorer l'expérience utilisateur et l'attrait de l'interface.</li></ul><h3>Technologies Utilisées :</h3><ul><li>React : Pour une interface dynamique et réactive.</li><li>Values.js : Pour générer une variété de nuances à partir de la couleur de base.</li><li>React-Reveal : Intégré pour des transitions et effets UI élégants.</li></ul>"
  },
  "tsSimpleModal": {
    "excerpt": "Un composant modal léger en TypeScript.",
    "description": "<p>Conception et publication d'un composant modal léger et personnalisable destiné aux applications React, entièrement rédigé en TypeScript.</p><h3>Caractéristiques Principales :</h3><ul><li>Disponibilité en tant que package NPM, mettant en avant la facilité d'intégration et de déploiement dans divers projets React.</li><li>Rédigé en TypeScript, garantissant la sécurité des types et une expérience de développement améliorée.</li><li>Flexibilité pour déterminer la visibilité du modal, les fonctions de fermeture, et le contenu du modal.</li></ul><h3>Technologies Utilisées :</h3><ul><li>TypeScript : Utilisé pour la vérification statique des types et une performance optimisée.</li><li>React : Utilisé pour créer le composant modal dynamique.</li></ul>"
  },
  "lesPetitsPlats": {
    "excerpt": "Conception d'un moteur de recherche de recettes pour un éditeur de livres de cuisine",
    "description": "<p>Mandaté par un éditeur de livres de cuisine établi s'aventurant dans le numérique, la mission était de concevoir un moteur de recherche de recettes puissant et convivial. Ce moteur est conçu pour être extrêmement réactif, lançant des recherches avec seulement 3 caractères entrés par l'utilisateur et mettant à jour les résultats à chaque nouvelle saisie.</p><p>La fonctionnalité de recherche peut être accédée via le champ de recherche principal ou à travers des tags, y compris les ingrédients, ustensiles et appareils. Les résultats proviennent d'une intersection des requêtes, assurant aux utilisateurs d'obtenir des recettes correspondant à tous les tags sélectionnés.</p><p><strong>Technologies Utilisées :</strong></p><ul><li>HTML5 (conforme W3C)</li><li>CSS3</li><li>JavaScript Vanilla</li></ul><p>Le projet souligne un engagement envers les principes du Green Code, la sécurité contre les injections HTML et la réutilisabilité.</p>"
  },
  "billed": {
    "excerpt": "Développement d'un système de reporting pour Billed pour rationaliser les remboursements",
    "description": "<p>Engagé avec Billed, un fournisseur de solutions SaaS de premier plan pour les équipes RH, l'objectif principal de ce projet était de déboguer le système existant de reporting des dépenses et d'en améliorer la stabilité. Les responsabilités comprenaient :</p> <ul> <li>Le débogage du code existant pour assurer une performance optimale.</li> <li>L'écriture de tests unitaires pour valider les parties individuelles du code.</li> <li>La création de tests d'intégration pour vérifier l'interaction entre les différentes parties de l'application.</li> <li>L'élaboration d'un plan de test de bout en bout pour garantir que l'ensemble du processus fonctionne comme prévu.</li> </ul> <p>Les processus de débogage et de test étaient essentiels pour améliorer la fiabilité, la sécurité et l'efficacité du système, conformément à l'engagement de Billed envers une expérience utilisateur transparente et une architecture robuste.</p>"
  },
  "kasa": {
    "excerpt": "Refonte du site Kasa de ASP.NET à React",
    "description": "<p>Il y a plus d'une décennie, le site web Kasa a été construit en utilisant ASP.NET, mais est devenu encombré de code obsolète.</p><p>Le principal objectif du projet était de transférer l'application vers React, en utilisant des composants et des routes React Router, conformément aux maquettes réactives de Figma.</p><p>Les exigences techniques clés comprenaient la création de composants React modulaires et réutilisables, une gestion appropriée de l'état et des props, une gestion efficace des événements, et plus encore. React Router gérait les paramètres de route URL pour chaque donnée immobilière, avec toute la logique du routeur combinée dans un seul fichier. Le résultat final devait être exempt d'erreurs et d'avertissements dans la console.</p>"
  },
  "argentBank": {
    "excerpt": "Collaboration avec Remede Agency pour une plateforme numérique d'Argent Bank.",
    "description": "<p>En collaboration avec Remede Agency, nous avons créé une plateforme numérique pour Argent Bank, un acteur innovant dans le secteur bancaire. Notre mission était de fournir aux clients une expérience bancaire numérique conviviale et fluide, couvrant tout, de la gestion du profil à la supervision des transactions.</p><h3>Caractéristiques Clés :</h3><ul><li>Interface conviviale pour les services bancaires.</li><li>Connexion sécurisée et gestion de profil.</li><li>Voir, ajouter, modifier ou supprimer des informations de transaction.</li></ul><h3>Technologies Utilisées :</h3><ul><li>React : Pour une conception web réactive et interactive.</li><li>Redux : Gestion de l'état pour garantir une expérience utilisateur fluide.</li><li>Swagger : Documentation et organisation de l'API backend.</li></ul>"
  },
  "HRnet": {
    "excerpt": "Migration de l'application HRnet d'un jQuery daté en React TypeScript.",
    "description": "<p>Engagés avec le département technologique de WealthHealth pour rajeunir leur application web interne HRnet, auparavant en proie à des problèmes en raison de son frontend jQuery daté.</p><h3>Principaux Résultats du Projet :</h3><ul><li>Transition de l'ensemble du projet HRnet vers un framework React moderne.</li><li>Remplacement de quatre plugins jQuery existants par des composants React, améliorant la fonctionnalité globale et l'UX.</li><li>Des tests de performance Lighthouse ont été menés, montrant une amélioration notable par rapport à l'ancienne version.</li></ul><h3>Technologies et Bibliothèques Utilisées :</h3><ul><li>React : Pour une interface utilisateur réactive et dynamique.</li><li>Material UI : Un framework UI React pour des composants UI plus interactifs.</li><li>Tanstack Table : Gérer les données au format tableau de manière plus efficace.</li></ul>"
  },
  "sportSee": {
    "excerpt": "Refonte du profil utilisateur SportSee offrant un aperçu des sessions d'entraînement.",
    "description": "<p>Chez SportSee, une startup en plein essor dans le coaching sportif, l'accent a été mis sur la refonte de la page de profil utilisateur. Cette nouvelle version offre aux utilisateurs un aperçu de leurs sessions d'entraînement terminées et du total des calories brûlées.</p><p>En utilisant React pour la reconstruction de la page de profil, le projet comportait des graphiques d'activité athlétique, exploitant la bibliothèque Recharts. </p><p>Le développement backend a employé NodeJS, facilitant les appels HTTP et servant des données fictives. Pour gérer ces appels, Fetch ou Axios étaient les outils privilégiés, organisés en dehors des composants React dans un service dédié. La modélisation des données jouait un rôle crucial pour garantir que les données de l'API étaient formatées de manière cohérente avant utilisation. La documentation du projet est complète et incluent Readme, JSDoc et proptypes.</p>"
  },
  "fishEye": {
    "excerpt": "Une plateforme pour photographes indépendants axée sur l'accessibilité",
    "description": "<p>FishEye, une plateforme dédiée aux photographes indépendants pour présenter leurs meilleurs travaux, souhaitait une refonte de leur site web datant d'une décennie. L'objectif était de passer d'un site statique à un site dynamique et accessible, le rendant ainsi un espace vivant pour les artistes. Ce prototype comportait :</p><ul><li>Une galerie multimédia interactive avec une fonction de \"like\" et de tri.</li><li>Une visionneuse média lightbox avec navigation par clavier.</li><li>Un formulaire de contact modale pour les utilisateurs désireux de contacter les photographes.</li></ul><p>L'accent a été mis sur l'accessibilité, garantissant une expérience sans faille aux utilisateurs malvoyants. Des éléments HTML sémantiques, des attributs ARIA et des textes alternatifs pour les images ont été soigneusement intégrés. De plus, le code respecte les normes modernes de JavaScript, est validé par ESLint et parfaitement lisible par les lecteurs d'écran.</p>"
  },
  "booki": {
    "excerpt": "A responsive platform developed using HTML and CSS only",
    "description": "<p>Description: Designed and developed a responsive web platform for \"Booki\" that provides users with options for accommodations in cities of their preference. The project was solely created using HTML and CSS without any collaboration.</p><ul><li><strong>Responsive Design:</strong> Integrated site designs for desktop, tablet, and mobile, ensuring seamless user experience across different devices.</li></ul><h3>Technological Stack:</h3><ul><li>HTML & CSS: Used to build the core frontend components ensuring a responsive design.</li></ul>"
  },
  "ohmyfood": {
    "excerpt": "Perfectly responsive application with pure CSS animations",
    "description": "<p>Description: Development of a 100% mobile platform for \"Ohmyfood!\", a startup aiming to revolutionize the culinary experience. The website lists menus from gourmet restaurants, allowing users to pre-compose their meals for quick service upon arrival.</p><ul><li><strong>Mobile-first Design:</strong> Ensures an optimal mobile user experience by implementing responsive designs for tablets and desktops.</li><li><strong>Elegant Animations:</strong> Use of CSS animations and transitions for various user interface interactions, including menu item selection and a custom \"loading spinner\".</li></ul><h4>Technologies & Constraints:</h4><ul><li>CSS & SASS: Website developed without frameworks, using SASS for enhanced styling capabilities.</li><li>Compatibility: Ensured website compatibility with the latest desktop versions of Chrome and Firefox, and passed W3C validations.</li></ul>"
  },
  "gameOn": {
    "excerpt": "Eenhancing the application's registration form functionality.",
    "description": "<p>Within the team at GameOn, a SME specializing in game conferences and competitions, the responsibility was undertaken to complete and enhance the application's registration form functionality. Following user feedback and the transition of a key team member, the project was picked up to ensure an optimal user experience.</p><ul><li>Implementation of validations for all form fields.</li><li>Addition of confirmation and error messages.</li></ul><h4>Technologies Used:</h4><ul><li>HTML: Basic structure of the form.</li><li>CSS: Design and layout of the form.</li><li>JavaScript: To make the form interactive, add validations, events, and transitions.</li></ul><h4>Why This Project:</h4><p>It was an opportunity to learn about the intricacies of form design, validation, and handling user input in a dynamic application.</p>"
  }
}
